[
    {
      "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/244366000_5074412845919272_4074808328604315808_n.jpg?_nc_cat=103&ccb=1-5&_nc_sid=973b4a&_nc_ohc=0J8Gy3mvHDIAX9vDucm&_nc_ht=scontent-dfw5-1.xx&oh=f926ee15b765e8db0d98ed8481214997&oe=6190F4FB",
      "address": "13900 N. 37th St.",
      "city":"McAllen",
      "state":"TX",
      "zip":"78504",
      "info": "BRAND NEW CONSTRUCTION in Vendome, an established yet growing subdivision in McAllen. This contemporary home has 3 bedrooms, 2 bathrooms, and private dining room which can also be made into an office.  Luxury living at its finest with stucco and cantera stone exterior, high quality finishes, tile throughout, and large sliding patio doors leading to the large, covered back patio to entertain guests.  This home boasts an 800 ft. master area that includes a large bedroom with a study area, bar, large walk-in his and ",
      "beds":"3",
      "baths":"2",
      "footage":"2,694",
      "link":"https://www.zillow.com/homedetails/13900-N-37th-St-McAllen-TX-78504/251811211_zpid/"
    },
    {
      "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/197830206_841191203166287_8316441942745943574_n.jpg?_nc_cat=101&ccb=1-5&_nc_sid=973b4a&_nc_ohc=BdjnNT-B9xQAX-52N-F&_nc_ht=scontent-dfw5-1.xx&oh=e1a71f031072c7b245a3889a172a49da&oe=61915746",
      "address": "4004 Beaulieu Drive",
      "city":"Edinburg",
      "state":"TX",
      "zip":"78541",
      "info": "Executive home in The Villas of McAllen.  This spectacular home offers over 2,700 sqft of luxury smart living with high quality finishes and beautiful custom large windows throughout.  Set in a private, quiet neighborhood, a home built by Alph Construction and extensively thought out and planned.  All smart home technology, appliances, and furniture included.  List available upon request.   Pre-qualification required for all showings.",
      "beds":"3",
      "baths":"2",
      "footage":"3,043",
      "link":"https://www.zillow.com/homedetails/4004-Beaulieu-Dr-McAllen-TX-78541/317319500_zpid/"
    },
    {
      "image": "https://scontent-dfw5-1.xx.fbcdn.net/v/t1.6435-9/171852956_4538356436191585_1692684222438009811_n.jpg?_nc_cat=105&ccb=1-5&_nc_sid=973b4a&_nc_ohc=CBue_hqXhRgAX8ZHfOp&_nc_ht=scontent-dfw5-1.xx&oh=59c62fd1cac74f17f03808512f9f7e9b&oe=6194344D",
      "address": "5501 Cornell Avenue",
      "city":"McAllen",
      "state":"TX",
      "zip":"78504",
      "info": "New construction home in Silverado Trails on Auburn Hills, a new subdivision in McAllen.  This contemporary home has 3 bedrooms, 3 bathrooms, 2 half-bathrooms, and a 540 sqft bonus room above the garage with possibilities.   Luxury living at its finest with high quality finishes and beautiful large windows throughout.  Exterior features include a sprinkler system, large patio to entertain family and friends, and automated exterior lighting.  This exclusive neighborhood also offers a park and private pool for the subdivision.",
      "beds":"4",
      "baths":"3.5",
      "footage":"3,240",
      "link":"https://www.realtor.com/realestateandhomes-detail/5501-Cornell-Ave_McAllen_TX_78504_M97985-34029"
    },
    {
      "image": "https://photos.zillowstatic.com/fp/81874f546e5d5505efb1b845e70346af-cc_ft_768.webp",
      "address": "205 Teak Dr",
      "city":"Edinburg",
      "state":"TX",
      "zip":"78541",
      "info": "PERFECT INVESTMENT OPPORTUNITY!  Fully rented 4-plexes in Edinburg's gated West Oaks apartment community.  Located half a mile from expressway and a mile from UTRGV, these units are perfect for anyone one looking for an investment property.  2 2/2 and 2 3/2 units have all tile flooring, extensive cabinets throughout, patios and side yards in the 2/2, larger yards in the 3/2s, and carports.  Tenants pay all utilities, owner pays only house meters for sprinklers an exterior lights and trash.  All units are currently ",
      "beds":"2/3",
      "baths":"2",
      "footage":"4,406",
      "link":"https://www.zillow.com/homedetails/205-Teak-Dr-Edinburg-TX-78541/245949486_zpid/"
    },
    {
      "image": "https://photos.zillowstatic.com/fp/094c71a0c1addb7e398bf38d39d76dfb-uncropped_scaled_within_1536_1152.webp",
      "address": "4000 Beaulieu Drive",
      "city":"Edinburg",
      "state":"TX",
      "zip":"78541",
      "info": "Wake up every day in luxury with this beautiful and modern exterior design 2 story, 3 bedroom, 3 bath home in a gated subdivision.  Featuring premium finishes, blown insulation, tankless water heater, and is High Performance Certified. You will love the feeling this home gives you! With amazing curb appeal, this home wows from the start. As you enter you will notice 24 foot high living room ceiling that is amazingly done that leads into the open kitchen and dining area. Gorgeous quartz countertops, porcelain tile throughout and modern custom cabinetry. The second floor houses the Master bedroom with an impressive master ",
      "beds":"3",
      "baths":"2",
      "footage":"2,635",
      "link":"https://www.zillow.com/homedetails/4000-Beaulieu-Dr-Edinburg-TX-78541/2077194488_zpid/"
    },
    {
      "image": "https://photos.zillowstatic.com/fp/70366bee7b7ea04e4167020b00641a55-cc_ft_576.webp",
      "address": "2309 McLeod Ave",
      "city":"Edinburg",
      "state":"TX",
      "zip":"78539",
      "info": "One of Edinburg's Newest Gated Community! Jackson Heights Like New Construction, stamped concrete, professional landscaping, high ceilings, stainless steel appliances, plantation shutters throughout, and a master area that's a show stopper! 4 bed 3.5 baths with a study! Corner of Canton and Jackson. Call Natalie 956-467-7702 to set up a showing!",
      "beds":"4",
      "baths":"4",
      "footage":"2,167",
      "link":"https://www.zillow.com/homedetails/2309-McLeod-Ave-Edinburg-TX-78539/251785534_zpid/"
    }
  ]


  